results/run-30vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 30 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  01.0s/30s

running (0m02.0s), 30/30 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  02.0s/30s

running (0m03.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  03.0s/30s

running (0m04.0s), 30/30 VUs, 60 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  04.0s/30s

running (0m05.0s), 30/30 VUs, 90 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  05.0s/30s

running (0m06.0s), 30/30 VUs, 110 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  06.0s/30s

running (0m07.0s), 30/30 VUs, 120 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  07.0s/30s

running (0m08.0s), 30/30 VUs, 150 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  08.0s/30s

running (0m09.0s), 30/30 VUs, 180 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  09.0s/30s

running (0m10.0s), 30/30 VUs, 210 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  10.0s/30s

running (0m11.0s), 30/30 VUs, 210 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  11.0s/30s

running (0m12.0s), 30/30 VUs, 240 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  12.0s/30s

running (0m13.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  13.0s/30s

running (0m14.0s), 30/30 VUs, 300 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  14.0s/30s

running (0m15.0s), 30/30 VUs, 320 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  15.0s/30s

running (0m16.0s), 30/30 VUs, 330 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  16.0s/30s

running (0m17.0s), 30/30 VUs, 360 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  17.0s/30s

running (0m18.0s), 30/30 VUs, 390 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  18.0s/30s

running (0m19.0s), 30/30 VUs, 410 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  19.0s/30s

running (0m20.0s), 30/30 VUs, 420 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  20.0s/30s

running (0m21.0s), 30/30 VUs, 450 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  21.0s/30s

running (0m22.0s), 30/30 VUs, 480 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  22.0s/30s

running (0m23.0s), 30/30 VUs, 500 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  23.0s/30s

running (0m24.0s), 30/30 VUs, 510 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  24.0s/30s

running (0m25.0s), 30/30 VUs, 540 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  25.0s/30s

running (0m26.0s), 30/30 VUs, 570 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  26.0s/30s

running (0m27.0s), 30/30 VUs, 590 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  27.0s/30s

running (0m28.0s), 30/30 VUs, 600 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  28.0s/30s

running (0m29.0s), 30/30 VUs, 630 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  29.0s/30s

running (0m30.0s), 30/30 VUs, 660 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......: 690     22.283151/s
    checks_succeeded...: 100.00% 690 out of 690
    checks_failed......: 0.00%   0 out of 690

    ✓ status 200

    HTTP
    http_req_duration..............: avg=154.26ms min=58.15ms med=188.26ms max=301.89ms p(90)=230.63ms p(95)=232.7ms
      { expected_response:true }...: avg=154.26ms min=58.15ms med=188.26ms max=301.89ms p(90)=230.63ms p(95)=232.7ms
    http_req_failed................: 0.00%  0 out of 1380
    http_reqs......................: 1380   44.566302/s

    EXECUTION
    iteration_duration.............: avg=1.33s    min=1.28s   med=1.3s     max=2.08s    p(90)=1.33s    p(95)=1.34s  
    iterations.....................: 690    22.283151/s
    vus............................: 30     min=30        max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 2.8 MB 90 kB/s
    data_sent......................: 167 kB 5.4 kB/s



running (0m31.0s), 00/30 VUs, 690 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  30s